w1nn3t0u-o7/MIDI-Cube/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 6.0.0 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ETHERNET_SPI_HOST=2
CONFIG_ETHERNET_SPI_SCLK_GPIO=7
CONFIG_ETHERNET_SPI_MOSI_GPIO=15
CONFIG_ETHERNET_SPI_MISO_GPIO=17
CONFIG_ETHERNET_SPI_CLOCK_MHZ=20
CONFIG_ETHERNET_SPI_CS0_GPIO=18
CONFIG_ETHERNET_SPI_INT0_GPIO=5
CONFIG_ETHERNET_SPI_PHY_RST0_GPIO=6
CONFIG_TINYUSB_MIDI_COUNT=1
